БухЭксп/InformationRegisters/CW_ДанныеПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДанныеПервичныхДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыПервичныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_КонтрагентыОбменаДокументами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_КонтрагентыОбменаДокументами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыПервичныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Счет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/HTTPServices/CW_ЭлектронныйОбменДанными/Ext/Module.bsl
Функция ПолучитьДокумент(Запрос)

	УстановитьПривилегированныйРежим(Истина);  
	
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку(); 
	
	СтруктураJSON = CW_РаботаСВнешнимиРесурсамиСервер.СтрокаJSONВОбъект(СтрокаJSON); 

	ИННКонтрагента = XMLЗначение(Тип("Строка"), СтруктураJSON.innorg);

	Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", ИННКонтрагента); 
	Если НЕ ПроверитьДоступностьОбменаДляКонтрагента(Контрагент) Тогда
		Ответ = Новый HTTPСервисОтвет(403);   
		Ответ.УстановитьТелоИзСтроки("Возможность обмена заблокирована поставщиком");
		Возврат Ответ;
	КонецЕсли;
	
	Организации = Новый Массив;
	Для Каждого СтрокаУид из СтруктураJSON.legalentities Цикл
		ОрганизацияСсылка = Справочники.Организации.ПолучитьСсылку(XMLЗначение(Тип("УникальныйИдентификатор"), СтрокаУид));
		ОрганизацияОбъект = ОрганизацияСсылка.ПолучитьОбъект();
		Если ОрганизацияОбъект <> Неопределено Тогда
			Организации.Добавить(ОрганизацияСсылка);	
		КонецЕсли;
	КонецЦикла;
	
	//Поиск документа
	Если СтруктураJSON.Свойство("id") Тогда
		
		ДокументДоходовСсылка = Документы.CW_ДоходыПоГрузоперевозке.ПолучитьСсылку(XMLЗначение(Тип("УникальныйИдентификатор"),СтруктураJSON.id));
	
		ДокументДоходовОбъект = ДокументДоходовСсылка.ПолучитьОбъект();
		Если ДокументДоходовОбъект = Неопределено Тогда
			Ответ = Новый HTTPСервисОтвет(404);   
			Ответ.УстановитьТелоИзСтроки("Документ по идентифкатору не найден!");
			Возврат Ответ;
		КонецЕсли;
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ДокументДоходовСсылка) Тогда 
		
		Если СтруктураJSON.Свойство("invoice") Тогда  
			НомерДляПечати = XMLЗначение(Тип("Строка"), СтруктураJSON.invoice.nomber);
			ДатаДокумента  = XMLЗначение(Тип("Дата"), СтруктураJSON.invoice.date);
			ВидДокумента   = Перечисления.CW_ВидыПервичныхДокументов.Счет;
		КонецЕсли;
		
		Если СтруктураJSON.Свойство("act") Тогда
			НомерДляПечати = XMLЗначение(Тип("Строка"), СтруктураJSON.act.nomber);
			ДатаДокумента  = XMLЗначение(Тип("Дата"), СтруктураJSON.act.date);
			ВидДокумента   = Перечисления.CW_ВидыПервичныхДокументов.Акт;
		КонецЕсли;  
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	CW_ДанныеПервичныхДокументов.Документ КАК Документ
		               |ИЗ
		               |	РегистрСведений.CW_ДанныеПервичныхДокументов КАК CW_ДанныеПервичныхДокументов
		               |ГДЕ
		               |	CW_ДанныеПервичныхДокументов.Организация В (&Организации)
		               |	И CW_ДанныеПервичныхДокументов.Контрагент = &Контрагент
		               |	И CW_ДанныеПервичныхДокументов.ВидДокумента = &ВидДокумента
		               |	И CW_ДанныеПервичныхДокументов.НомерДляПечати = &НомерДляПечати
		               |	И CW_ДанныеПервичныхДокументов.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания"; 
		
		Запрос.УстановитьПараметр("Контрагент", 	Контрагент);
		Запрос.УстановитьПараметр("Организации", 	Организации);
		Запрос.УстановитьПараметр("ВидДокумента", 	ВидДокумента);
		Запрос.УстановитьПараметр("НомерДляПечати", НомерДляПечати);
		Запрос.УстановитьПараметр("ДатаНачала", 	НачалоДня(ДатаДокумента));
		Запрос.УстановитьПараметр("ДатаОкончания", 	КонецДня(ДатаДокумента));
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ДокументДоходовСсылка = Выборка.Документ;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументДоходовСсылка) Тогда
		Ответ = Новый HTTPСервисОтвет(404);   
		Ответ.УстановитьТелоИзСтроки("Документ не найден!");
		Возврат Ответ;
	КонецЕсли;
	//---Поиск документа
	
	//Получение данных документа
	ТабличныйДокумент = ПодготовитьТабличныйДокумент(ДокументДоходовСсылка, ВидДокумента);
	ТабличныйДокументJSON = CW_ОбщийМодульЛичныйКабинетСервер.СериализацияXDTO_JSON(ТабличныйДокумент);
	//---Получение данных документа  
	
	//Данные счета
	ДанныеНомера = Новый Структура;   
	ДанныеНомера.Вставить("Организация", 	ДокументДоходовСсылка.Организация);
	ДанныеНомера.Вставить("Номер", 			ДокументДоходовСсылка.НомерСчета);
	ДанныеНомера.Вставить("Дата", 			ДокументДоходовСсылка.ДатаСчета);
	
	НомерСчета 	= CW_Документы.ПолучитьНомерНаПечать(ДанныеНомера);	
	
	ДанныеСчета = Новый Структура;
	ДанныеСчета.Вставить("be", 		XMLСтрока(ДокументДоходовСсылка.ФормируетсяСчет));
	ДанныеСчета.Вставить("data", 	XMLСтрока(ДокументДоходовСсылка.ДатаСчета));
	ДанныеСчета.Вставить("nomber", 	XMLСтрока(НомерСчета));
	//---Данные счета
	
	
	//Данные Акта
	ДанныеНомера = Новый Структура;   
	ДанныеНомера.Вставить("Организация", 	ДокументДоходовСсылка.Организация);
	ДанныеНомера.Вставить("Номер", 			ДокументДоходовСсылка.НомерАкта);
	ДанныеНомера.Вставить("Дата", 			ДокументДоходовСсылка.ДатаАкта);
	
	НомерАкта 	= CW_Документы.ПолучитьНомерНаПечать(ДанныеНомера);	
	
	ДанныеАкта = Новый Структура;
	ДанныеАкта.Вставить("be", 		XMLСтрока(ДокументДоходовСсылка.ФормируетсяАкт));
	ДанныеАкта.Вставить("data", 	XMLСтрока(ДокументДоходовСсылка.ДатаАкта));   
	ДанныеАкта.Вставить("nomber", 	XMLСтрока(НомерАкта));
	//---Данные счета   
	
	
	//Данные счет-фактуры
	ДанныеНомера = Новый Структура;   
	ДанныеНомера.Вставить("Организация", 	ДокументДоходовСсылка.Организация);
	ДанныеНомера.Вставить("Номер", 			ДокументДоходовСсылка.НомерСчетаФактуры);
	ДанныеНомера.Вставить("Дата", 			ДокументДоходовСсылка.ДатаСчетаФактуры);
	
	НомерСчетаФактуры = CW_Документы.ПолучитьНомерНаПечать(ДанныеНомера);	
	
	ДанныеСчетаФактуры = Новый Структура;
	ДанныеСчетаФактуры.Вставить("be", 		XMLСтрока(ДокументДоходовСсылка.ФормируетсяСчетФактура));
	ДанныеСчетаФактуры.Вставить("data", 	XMLСтрока(ДокументДоходовСсылка.ДатаСчетаФактуры));   
	ДанныеСчетаФактуры.Вставить("nomber", 	XMLСтрока(НомерСчетаФактуры));
	//---Данные счет-фактуры
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("id",	XMLСтрока(ДокументДоходовСсылка));
	СтруктураJSON.Вставить("acc", 	ДанныеСчета);
	СтруктураJSON.Вставить("act", 	ДанныеАкта);
	СтруктураJSON.Вставить("inv", 	ДанныеСчетаФактуры);
	СтруктураJSON.Вставить("tab", 	ТабличныйДокументJSON);
	
	СтрокаJSON = CW_РаботаСВнешнимиРесурсамиСервер.ОбъектВСтрокуJSON(СтруктураJSON);
	
	Ответ = Новый HTTPСервисОтвет(200);   
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON); 
	
	Возврат Ответ;  
	
КонецФункции

//Служебные
Функция ПроверитьДоступностьОбменаДляКонтрагента(Контрагент)
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Ложь;
	КонецЕсли; 

	//разрешено всем(0), разрешено выбранным(1), запрещено выбранным(2)
	ПорядокДоступа = Константы.CW_ПорядокДоступаКДокументам.Получить(); 
	Если ПорядокДоступа = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_КонтрагентыОбменаДокументами.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.CW_КонтрагентыОбменаДокументами КАК CW_КонтрагентыОбменаДокументами
	|ГДЕ
	|	CW_КонтрагентыОбменаДокументами.Контрагент = &Контрагент"; 
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();  
	
	Если ПорядокДоступа = 1 Тогда
		Возврат НЕ РезультатЗапроса.Пустой();  
	Иначе
		Возврат РезультатЗапроса.Пустой();  
	КонецЕсли;
	
КонецФункции   

Функция ПодготовитьТабличныйДокумент(ДокументДоходов, ВидДокумента=Неопределено)
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= ДокументДоходов.Дата;
	СтруктураПараметров.Договор 			= ДокументДоходов.Договор;
	СтруктураПараметров.ПриложениеКДоговору = ДокументДоходов.ПриложениеКДоговору;
	
	ПараметрыДоговора = CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров);
	
	Если ВидДокумента = Перечисления.CW_ВидыПервичныхДокументов.Счет Тогда
		ВариантСвертки = ПараметрыДоговора.ВариантСверткиНоменклатурыДляСчетов;
	Иначе
		ВариантСвертки = ПараметрыДоговора.ВариантСверткиНоменклатурыДляАктов;
	КонецЕсли; 
	
	УслугиДокумента = ДокументДоходов.Услуги.Выгрузить(); 
	ТаблицаДокумента = УслугиДокумента.Скопировать(,"Грузоперевозка,Номенклатура,Представление,Количество,Цена,Сумма,СтавкаНДС,НДС,Всего");
	
	Если ЗначениеЗаполнено(ВариантСвертки) Тогда
		Для Каждого СтрокаТабицы из ТаблицаДокумента Цикл
			НайденнаяСтрока = ВариантСвертки.ТаблицаЗамены.Найти(СтрокаТабицы.Номенклатура, "ЗаменяемаяНоменклатура");
			Если НайденнаяСтрока <> Неопределено Тогда
				СтрокаТабицы.Номенклатура 	= НайденнаяСтрока.Номенклатура; 
				СтрокаТабицы.Представление 	= CW_Шаблоны.ОбработатьШаблонНоменклатуры(ВариантСвертки.ШаблонСверткиПоГрузоперевозкам, ДокументДоходов);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;   
	
	ДанныеДополнительныхПолей = Новый Соответствие;
	
	ТаблицаДополнительныхПолей = Новый ТаблицаЗначений;  
	ТаблицаДополнительныхПолей.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	ТаблицаДополнительныхПолей.Колонки.Добавить("ИмяПоля", Новый ОписаниеТипов("Строка"));
	
	ПарамтерыШаблона = Новый Структура;
	ПарамтерыШаблона.Вставить("Контрагент", ДокументДоходов.Контрагент);
	
	Для Каждого СтрокаТаблицы из ТаблицаДокумента Цикл
		
		ПарамтерыШаблона.Вставить("ТипПеревозки", СтрокаТаблицы.Грузоперевозка.ТипПеревозки);
		
		ШаблонГрузоперевозоки = CW_ЭлектронныйОбменДанными.ПолучитьШаблонГрузоперевозоки(ПарамтерыШаблона);
		
		ДанныеГрузоперевозки = Новый Структура;
		
		Для Каждого СтрокаСостава из ШаблонГрузоперевозоки.СоставПолей Цикл
			ЗначениеПоля = Неопределено;
			
			мОбъектыПриоритета = СтрокаСостава.ХранилищеПриоритета.Получить();
			
			Если ТипЗнч(СтрокаСостава.ПолеОбъекта) = Тип("Строка") Тогда
				//Реквизит
				ЗначениеПоля = СтрокаТаблицы.Грузоперевозка[СтрокаСостава.ПолеОбъекта];
			Иначе   
				
				ПараметрыГрузоперевозки = СтрокаТаблицы.Грузоперевозка.ПараметрыГрузоперевозки; 
				ПараметрыЗаказа 		= СтрокаТаблицы.Грузоперевозка.Заказ.ПараметрыЗаказа;
				ПараметрыЗаявки 		= СтрокаТаблицы.Грузоперевозка.Заявка.ПараметрыЗаявки;
				
				//Парамтер  
				Для Каждого ОбъектПриоритета из мОбъектыПриоритета Цикл
					Если ЗначениеЗаполнено(ЗначениеПоля) Тогда
						Прервать;
					КонецЕсли;
					
					Если ОбъектПриоритета = "Грузоперевозка" Тогда   
						СтрокаПараметра	= ПараметрыГрузоперевозки.Найти(СтрокаСостава.ПолеОбъекта, "Параметр"); 
						ЗначениеПоля	= СтрокаПараметра.Значение;
					КонецЕсли;
					
					Если ОбъектПриоритета = "Заказ" 
						и ЗначениеЗаполнено(СтрокаТаблицы.Грузоперевозка.Заказ) Тогда
						СтрокаПараметра = ПараметрыЗаказа.Найти(СтрокаСостава.ПолеОбъекта, "Параметр"); 
						ЗначениеПоля 	= СтрокаПараметра.Значение;
					КонецЕсли;
					
					Если ОбъектПриоритета = "Заявка" 
						и ЗначениеЗаполнено(СтрокаТаблицы.Грузоперевозка.Заявка) Тогда
						СтрокаПараметра = ПараметрыЗаявки.Найти(СтрокаСостава.ПолеОбъекта, "Параметр"); 
						ЗначениеПоля 	= СтрокаПараметра.Значение;
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
			НайденнаяСтрока = ТаблицаДополнительныхПолей.Найти(СокрЛП(СтрокаСостава.ИмяПоля), "ИмяПоля");
			Если НайденнаяСтрока = Неопределено Тогда
				НоваяСтрока = ТаблицаДополнительныхПолей.Добавить(); 
				НоваяСтрока.Порядок = СтрокаСостава.НомерСтроки;
				НоваяСтрока.ИмяПоля = СокрЛП(СтрокаСостава.ИмяПоля);
			КонецЕсли;
			
			ДанныеГрузоперевозки.Вставить(СокрЛП(СтрокаСостава.ИмяПоля), ЗначениеПоля); 
			
		КонецЦикла;
		
		ДанныеДополнительныхПолей.Вставить(СтрокаТаблицы.Грузоперевозка, ДанныеГрузоперевозки);
		
	КонецЦикла; 
	
	ИндексКлонки = ТаблицаДокумента.Колонки.Индекс(ТаблицаДокумента.Колонки.Найти("Грузоперевозка"));
	ИндексКлонки = ИндексКлонки + 1;
	
	ТаблицаДополнительныхПолей.Сортировать("Порядок УБЫВ");    
	Для Каждого СтрокаТаблицы из ТаблицаДополнительныхПолей Цикл
		ТаблицаДокумента.Колонки.Вставить(ИндексКлонки, СтрокаТаблицы.ИмяПоля);
	КонецЦикла;
	
	//Заполняем дополнителдьные поля  
	Если ТаблицаДополнительныхПолей.Количество() > 0 Тогда  
		Для Каждого СтрокаТаблицы из ТаблицаДокумента Цикл
			ДополнительныеПоля = ДанныеДополнительныхПолей.Получить(СтрокаТаблицы.Грузоперевозка);  
			Для Каждого КлючЗначение из ДополнительныеПоля Цикл
				СтрокаТаблицы[КлючЗначение.Ключ] = КлючЗначение.Значение;	
			КонецЦикла;
		КонецЦикла;                                          
	КонецЕсли;
	//Заполняем дополнителдьные поля
	
	//Формируем табличный документ;
	ТабличныйДокумент = Новый ТабличныйДокумент;   
	
	СоответствиеФорматаКолонок = Новый Соответствие;
	СоответствиеФорматаКолонок.Вставить(Тип("Число"), 	"ЧДЦ=2; ЧГ=0");	 
	СоответствиеФорматаКолонок.Вставить(Тип("Дата"), 	"ДФ=dd.MM.yyyy");	 
	
	//Заголовки колонок
	НомерСтроки = 1; НомерКолонки = 0;
	Для Каждого Колонка из ТаблицаДокумента.Колонки Цикл
		НомерКолонки = НомерКолонки + 1;
		
		Область	= ТабличныйДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки);
		Область.Текст = Колонка.Имя;
	КонецЦикла;
	//---Заголовки колонок 
	
	//Строки таблицы  
	НомерСтроки = 1; 
	Для Каждого СтрокаДокумента из ТаблицаДокумента Цикл
		НомерСтроки  = НомерСтроки + 1;
		НомерКолонки = 0;   
		
		Для Каждого Колонка из ТаблицаДокумента.Колонки Цикл
			НомерКолонки = НомерКолонки + 1;
			
			Область	= ТабличныйДокумент.Область(НомерСтроки, НомерКолонки, НомерСтроки, НомерКолонки); 
			
			ЗначениеПоля = СтрокаДокумента[Колонка.Имя];
			ФорматЗначения = СоответствиеФорматаКолонок.Получить(ТипЗнч(ЗначениеПоля));
			Если Колонка.Имя = "Количество" Тогда
				ФорматЗначения = "ЧГ=0";
			КонецЕсли;
			
			Если ФорматЗначения <> Неопределено Тогда  
				Область.Текст = Формат(ЗначениеПоля, ФорматЗначения);
			Иначе
				Область.Текст = СокрЛП(ЗначениеПоля);
			КонецЕсли;
			
		КонецЦикла;  
		
	КонецЦикла;
		//--Строки таблицы
	
	Возврат ТабличныйДокумент;
	
КонецФункции
//Служебные
